In [2]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [5]:
dFrame1 = DataFrame({'key':['X','Y','Z','A','B','X','X'], 'data_set_1':np.arange(7)})

In [6]:
dFrame1

   data_set_1 key
0           0   X
1           1   Y
2           2   Z
3           3   A
4           4   B
5           5   X
6           6   X

In [7]:
dFrame2 = DataFrame({'key':['Q','X','Z'],'data_set_2': [1,2,3]})

In [8]:
dFrame2

   data_set_2 key
0           1   Q
1           2   X
2           3   Z

In [9]:
pd.merge(dFrame1,dFrame2)

   data_set_1 key  data_set_2
0           0   X           2
1           5   X           2
2           6   X           2
3           2   Z           3

In [10]:
pd.merge(dFrame1,dFrame2,on='key')

   data_set_1 key  data_set_2
0           0   X           2
1           5   X           2
2           6   X           2
3           2   Z           3

In [12]:
pd.merge(dFrame1,dFrame2,on='key',how='right') #right,left or outer

   data_set_1 key  data_set_2
0           0   X           2
1           5   X           2
2           6   X           2
3           2   Z           3
4         NaN   Q           1

In [13]:
dframe3 = DataFrame({'key':['X','X','Y','Z'],'data_set_3': range(4)})

In [14]:
dframe4 = DataFrame({'key':['Y','Y','Z','X'],'data_set_4':range(4)})

In [16]:
dframe3

   data_set_3 key
0           0   X
1           1   X
2           2   Y
3           3   Z

In [18]:
dframe4

   data_set_4 key
0           0   Y
1           1   Y
2           2   Z
3           3   X

In [19]:
pd.merge(dframe3,dframe4)

   data_set_3 key  data_set_4
0           0   X           3
1           1   X           3
2           2   Y           0
3           2   Y           1
4           3   Z           2

In [22]:
df_left = DataFrame({'key1':['SF','SF','LA'],
                     'key2':['one','one','second'],
                    'left_data':[10,20,30]})

In [23]:
df_right = DataFrame({'key1':['SF','SF','LA','LA'],
                     'key2':['one','one','one','two'],
                     'right_data': [40,50,60,70]})

In [25]:
df_right

  key1 key2  right_data
0   SF  one          40
1   SF  one          50
2   LA  one          60
3   LA  two          70

In [26]:
df_left

  key1    key2  left_data
0   SF     one         10
1   SF     one         20
2   LA  second         30

In [28]:
pd.merge(df_left,df_right,on=['key1','key2'],how='outer')

  key1    key2  left_data  right_data
0   SF     one         10          40
1   SF     one         10          50
2   SF     one         20          40
3   SF     one         20          50
4   LA  second         30         NaN
5   LA     one        NaN          60
6   LA     two        NaN          70

In [30]:
pd.merge(df_left,df_right,on='key1')

  key1  key2_x  left_data key2_y  right_data
0   SF     one         10    one          40
1   SF     one         10    one          50
2   SF     one         20    one          40
3   SF     one         20    one          50
4   LA  second         30    one          60
5   LA  second         30    two          70

In [31]:
pd.merge(df_left,df_right,on='key1',suffixes=('_lefty','_righty'))

  key1 key2_lefty  left_data key2_righty  right_data
0   SF        one         10         one          40
1   SF        one         10         one          50
2   SF        one         20         one          40
3   SF        one         20         one          50
4   LA     second         30         one          60
5   LA     second         30         two          70